iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_audio.c
/* DFSDM Filter Msp config */
static void DFSDM_FilterMspInit(DFSDM_Filter_HandleTypeDef *hDfsdmFilter);
static void DFSDM_FilterMspDeInit(DFSDM_Filter_HandleTypeDef *hDfsdmFilter);

/* DFSDM Filter conversion callbacks */
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
static void DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
static void DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */

#if (USE_AUDIO_CODEC_CS42L51 == 1)
static int32_t CS42L51_Probe(void);
static int32_t CS42L51_PowerUp(void);
static int32_t CS42L51_PowerDown(void);
#endif

/**
  * @}
  */

/** @defgroup STM32H7B3I_EVAL_AUDIO_OUT_Exported_Functions AUDIO OUT Exported Functions
  * @{
  */
/**
  * @brief  Configures the audio peripherals.
  * @param  Instance   AUDIO OUT Instance. It can only be 0 (SAI) or 1 (I2S)
  * @param  AudioInit  AUDIO OUT init Structure
  * @retval BSP status
  */
int32_t BSP_AUDIO_OUT_Init(uint32_t Instance, BSP_AUDIO_Init_t* AudioInit)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Fill Audio_Out_Ctx structure */
    Audio_Out_Ctx[Instance].Device         = AudioInit->Device;
    Audio_Out_Ctx[Instance].Instance       = Instance;
    Audio_Out_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
    Audio_Out_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
    Audio_Out_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
    Audio_Out_Ctx[Instance].Volume         = AudioInit->Volume;
    Audio_Out_Ctx[Instance].State          = AUDIO_OUT_STATE_RESET;

#if (USE_AUDIO_CODEC_CS42L51 == 1)
    if ((Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET) && (Audio_In_Ctx[1].State == AUDIO_IN_STATE_RESET))
    {
      if (CS42L51_PowerUp() != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        if(CS42L51_Probe() != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
      }
    }
#endif
    if(ret == BSP_ERROR_NONE)
    {
      if(Instance == 0U)
      {
        /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
        if(MX_SAI1_ClockConfig(&haudio_out_sai, AudioInit->SampleRate) != HAL_OK)
        {
          ret = BSP_ERROR_CLOCK_FAILURE;
        }
        else
        {
          /* SAI data transfer preparation:
          Prepare the Media to be used for the audio transfer from memory to SAI peripheral */
          haudio_out_sai.Instance = AUDIO_OUT_SAIx;
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
          /* Register the MSP Callbacks */
          if(Audio_Out_Ctx[Instance].IsMspCallbacksValid == 0U)
          {
            if(BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
          }
#else
          SAI_MspInit(&haudio_out_sai);
#endif
        }
      }
      else
      {
        /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
        if(MX_I2S6_ClockConfig(&haudio_out_i2s, AudioInit->SampleRate) != HAL_OK)
        {
          ret = BSP_ERROR_CLOCK_FAILURE;
        }
        else
        {
          /* I2S data transfer preparation:
          Prepare the Media to be used for the audio transfer from memory to I2S peripheral */
          haudio_out_i2s.Instance = AUDIO_OUT_I2Sx;
#if (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
          /* Register the MSP Callbacks */
          if(Audio_Out_Ctx[Instance].IsMspCallbacksValid == 0U)
          {
            if(BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
          }
#else
          I2S_MspInit(&haudio_out_i2s);
#endif
        }
      }

      if(ret == BSP_ERROR_NONE)
      {
          if(Instance == 0U)
          {
            MX_SAI_Config mx_sai_config;

            /* Prepare haudio_out_sai handle */
            mx_sai_config.AudioFrequency    = AudioInit->SampleRate;
            mx_sai_config.AudioMode         = SAI_MODEMASTER_TX;
            mx_sai_config.ClockStrobing     = SAI_CLOCKSTROBING_FALLINGEDGE;
            mx_sai_config.MonoStereoMode    = (AudioInit->ChannelsNbr == 1U) ? SAI_MONOMODE : SAI_STEREOMODE;
            if (AudioInit->BitsPerSample == AUDIO_RESOLUTION_24B)
            {
              mx_sai_config.DataSize          = SAI_DATASIZE_24;
              mx_sai_config.FrameLength       = 64;
              mx_sai_config.ActiveFrameLength = 32;
            }
            else
            {
              mx_sai_config.DataSize          = SAI_DATASIZE_16;
              mx_sai_config.FrameLength       = 32;
              mx_sai_config.ActiveFrameLength = 16;
            }

            mx_sai_config.OutputDrive       = SAI_OUTPUTDRIVE_ENABLE;
            mx_sai_config.Synchro           = SAI_ASYNCHRONOUS;
            mx_sai_config.SynchroExt        = SAI_SYNCEXT_DISABLE;
            mx_sai_config.SlotActive        = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

            /* SAI peripheral initialization: this __weak function can be redefined by the application  */
            if(MX_SAI1_Block_A_Init(&haudio_out_sai, &mx_sai_config) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
            /* Register SAI TC, HT and Error callbacks */
            else if(HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_COMPLETE_CB_ID, SAI_TxCpltCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else if(HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_HALFCOMPLETE_CB_ID, SAI_TxHalfCpltCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if(HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
#endif
          }
          else
          {
            MX_I2S_Config mx_i2s_config;
            mx_i2s_config.AudioMode         = I2S_MODE_MASTER_TX;
            mx_i2s_config.SampleRate        = AudioInit->SampleRate;

            /* I2S peripheral initialization: this __weak function can be redefined by the application  */
            if(MX_I2S6_Init(&haudio_out_i2s, &mx_i2s_config) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
            else if(HAL_I2S_RegisterCallback(&haudio_out_i2s, HAL_I2S_TX_COMPLETE_CB_ID, I2S_TxCpltCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else if(HAL_I2S_RegisterCallback(&haudio_out_i2s, HAL_I2S_TX_HALF_COMPLETE_CB_ID, I2S_TxHalfCpltCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if(HAL_I2S_RegisterCallback(&haudio_out_i2s, HAL_I2S_ERROR_CB_ID, I2S_ErrorCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
#endif
          }

          if(ret == BSP_ERROR_NONE)
          {
#if (USE_AUDIO_CODEC_CS42L51 == 1)
            CS42L51_Init_t codec_init;
              /* Fill codec_init structure */
              codec_init.InputDevice  = ((Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET) && (Audio_In_Ctx[1].State == AUDIO_IN_STATE_RESET)) ?\
                                          CS42L51_IN_NONE : ((Audio_In_Ctx[0].Device == AUDIO_IN_DEVICE_ANALOG_LINE1) ||\
                                         (Audio_In_Ctx[1].Device == AUDIO_IN_DEVICE_ANALOG_LINE1)) ? CS42L51_IN_LINE1 : CS42L51_IN_MIC1;
              codec_init.OutputDevice = CS42L51_OUT_HEADPHONE;
              codec_init.Frequency    = AudioInit->SampleRate;
              codec_init.Resolution   = CS42L51_RESOLUTION_16b; /* Not used */
              codec_init.Volume       = AudioInit->Volume;
            if (Instance == 0U)
            {
              /* Initialize the codec internal registers */
              if(Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
              {
                ret = BSP_ERROR_COMPONENT_FAILURE;
              }
            }
            else
            {
              /* Receive fake I2S data in order to generate MCLK needed by CS42L51 to set its registers */
              if(HAL_I2S_Transmit_DMA(&haudio_out_i2s, ((uint16_t*)0x38000000), 16) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                /* Initialize the codec internal registers */
                if(Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
                {
                  ret = BSP_ERROR_COMPONENT_FAILURE;
                }
                else
                {
                  /* Stop receiving fake I2S data */
                  if(HAL_I2S_DMAStop(&haudio_out_i2s) != HAL_OK)
                  {
                    ret = BSP_ERROR_PERIPH_FAILURE;
                  }
                }
              }
            }
#endif
            /* Update BSP AUDIO OUT state */
            Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_STOP;
          }
      }
    }
  }

  return ret;
}

/**
  * @brief  De-initializes the audio out peripheral.
  * @param  Instance AUDIO OUT Instance. It can only be 0 (SAI) or 1 (I2S)
  * @retval None
  */
int32_t BSP_AUDIO_OUT_DeInit(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (Audio_Out_Ctx[Instance].State == AUDIO_OUT_STATE_RESET)
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    /* Reset audio codec if not currently used by audio in instances */
    if ((Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET) || (Audio_In_Ctx[1].State == AUDIO_IN_STATE_RESET))
    {
      if (CS42L51_PowerDown() != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
    if (ret == BSP_ERROR_NONE)
    {
      if(Instance == 0U)
      {
        if(HAL_SAI_DeInit(&haudio_out_sai) != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
        SAI_MspDeInit(&haudio_out_sai);
#endif
      }
      else
      {
        if(HAL_I2S_DeInit(&haudio_out_i2s) != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
#if (USE_HAL_I2S_REGISTER_CALLBACKS == 0)
        I2S_MspDeInit(&haudio_out_i2s);
#endif
      }
      if (ret == BSP_ERROR_NONE)
      {
        /* Call the Media layer stop function */
        if(Audio_Drv->DeInit(Audio_CompObj) < 0)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
          /* Update BSP AUDIO OUT state */
          Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_RESET;
        }
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Initializes the Audio Codec audio out instance (SAI).
  * @param  hsai SAI handle
  * @param  MXConfig SAI confiruration structure
  * @note   Being __weak it can be overwritten by the application
  * @retval HAL status
  */
__weak HAL_StatusTypeDef MX_SAI1_Block_A_Init(SAI_HandleTypeDef* hsai, MX_SAI_Config *MXConfig)
{
  HAL_StatusTypeDef ret = HAL_OK;

