iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_audio.c
      if(Instance == 0U)
      {
        /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
        if(MX_SAI1_ClockConfig(&haudio_in_sai, AudioInit->SampleRate) != HAL_OK)
        {
          ret = BSP_ERROR_CLOCK_FAILURE;
        }
        else
        {
          haudio_in_sai.Instance    = AUDIO_IN_SAIx;
          haudio_out_sai.Instance   = AUDIO_OUT_SAIx;
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
          SAI_MspInit(&haudio_in_sai);
#else
          /* Register the default SAI MSP callbacks */
          if(Audio_In_Ctx[Instance].IsMspCallbacksValid == 0U)
          {
            if(BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
          }
          if (ret == BSP_ERROR_NONE)
          {
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
            MX_SAI_Config mx_config;

            /* Prepare haudio_in_sai handle */
            mx_config.AudioFrequency        = Audio_In_Ctx[Instance].SampleRate;
            mx_config.AudioMode             = SAI_MODESLAVE_RX;
            mx_config.ClockStrobing         = SAI_CLOCKSTROBING_FALLINGEDGE;
            mx_config.MonoStereoMode        = (AudioInit->ChannelsNbr == 1U) ? SAI_MONOMODE : SAI_STEREOMODE;
            mx_config.DataSize              = SAI_DATASIZE_16;
            mx_config.FrameLength           = 32;
            mx_config.ActiveFrameLength     = 16;
            mx_config.OutputDrive           = SAI_OUTPUTDRIVE_ENABLE;
            mx_config.Synchro               = SAI_SYNCHRONOUS;
            mx_config.SynchroExt            = SAI_SYNCEXT_DISABLE;
            if(Audio_In_Ctx[Instance].Device == AUDIO_IN_DEVICE_ANALOG_MIC)
            {
              mx_config.SlotActive          = SAI_SLOTACTIVE_0;
            }
            else
            {
              mx_config.SlotActive          = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;
            }

            if(MX_SAI1_Block_B_Init(&haudio_in_sai, &mx_config) != HAL_OK)
            {
              /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              /* Prepare haudio_out_sai handle */
              mx_config.AudioMode         = SAI_MODEMASTER_TX;
              mx_config.Synchro           = SAI_ASYNCHRONOUS;
              mx_config.SlotActive        = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

              if(MX_SAI1_Block_A_Init(&haudio_out_sai, &mx_config) != HAL_OK)
              {
                /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
            if (ret == BSP_ERROR_NONE)
            {
              /* Register SAI TC, HT and Error callbacks */
              if(HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_COMPLETE_CB_ID, SAI_RxCpltCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
              else if(HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_HALFCOMPLETE_CB_ID, SAI_RxHalfCpltCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                if(HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
                {
                  ret = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
#if (USE_AUDIO_CODEC_CS42L51 == 1)
            if (ret == BSP_ERROR_NONE)
            {
              CS42L51_Init_t codec_init;

              /* Fill codec_init structure */
              codec_init.OutputDevice = ((Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) && (Audio_Out_Ctx[1].State == AUDIO_OUT_STATE_RESET)) ?\
            CS42L51_OUT_NONE : CS42L51_OUT_HEADPHONE;
            codec_init.Frequency    = AudioInit->SampleRate;
            codec_init.Resolution   = CS42L51_RESOLUTION_16b; /* Not used */
            codec_init.Volume       = AudioInit->Volume;
            codec_init.InputDevice  = (AudioInit->Device == AUDIO_IN_DEVICE_ANALOG_LINE1) ? CS42L51_IN_LINE1 : CS42L51_IN_MIC1;

            /* Initialize the codec internal registers */
            if(Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
            {
              ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            else
            {
              /* Update audio in context state */
              Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_STOP;
            }
            }
#endif  /*USE_AUDIO_CODEC_CS42L51 == 1)*/
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
          }
#endif
        }
      }
      else if(Instance == 1U)
      {
        /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
        if(MX_I2S6_ClockConfig(&haudio_in_i2s, AudioInit->SampleRate) != HAL_OK)
        {
          ret = BSP_ERROR_CLOCK_FAILURE;
        }
        else
        {
          /* I2S data transfer preparation:
          Prepare the Media to be used for the audio transfer from memory to I2S peripheral */
          haudio_in_i2s.Instance = AUDIO_OUT_I2Sx;

#if (USE_HAL_I2S_REGISTER_CALLBACKS == 0)
          I2S_MspInit(&haudio_in_i2s);
#else
          /* Register the default SAI MSP callbacks */
          if(Audio_In_Ctx[Instance].IsMspCallbacksValid == 0U)
          {
            if(BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
          }
          if(ret == BSP_ERROR_NONE)
          {
#endif /* (USE_HAL_I2S_REGISTER_CALLBACKS == 1) */
            MX_I2S_Config mx_i2s_config;
            mx_i2s_config.AudioMode         = I2S_MODE_MASTER_RX;
            mx_i2s_config.SampleRate        = AudioInit->SampleRate;

            /* I2S peripheral initialization: this __weak function can be redefined by the application  */
            if(MX_I2S6_Init(&haudio_in_i2s, &mx_i2s_config) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
#if (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
              if(HAL_I2S_RegisterCallback(&haudio_in_i2s, HAL_I2S_TX_COMPLETE_CB_ID, I2S_TxCpltCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
              else if(HAL_I2S_RegisterCallback(&haudio_in_i2s, HAL_I2S_TX_HALF_COMPLETE_CB_ID, I2S_TxHalfCpltCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                if(HAL_I2S_RegisterCallback(&haudio_in_i2s, HAL_I2S_ERROR_CB_ID, I2S_ErrorCallback) != HAL_OK)
                {
                  ret = BSP_ERROR_PERIPH_FAILURE;
                }
              }

              if(ret == BSP_ERROR_NONE)
              {
#endif /* (USE_HAL_I2S_REGISTER_CALLBACKS == 1) */

