iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_audio.c
#if (USE_AUDIO_CODEC_CS42L51 == 1)
                /* Initialize the codec internal registers */
                CS42L51_Init_t codec_init;

                /* Fill codec_init structure */
                codec_init.OutputDevice = ((Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) && (Audio_Out_Ctx[1].State == AUDIO_OUT_STATE_RESET)) ?\
              CS42L51_OUT_NONE : CS42L51_OUT_HEADPHONE;
              codec_init.Frequency    = AudioInit->SampleRate;
              codec_init.Resolution   = CS42L51_RESOLUTION_16b; /* Not used */
              codec_init.Volume       = AudioInit->Volume;
              codec_init.InputDevice  = (AudioInit->Device == AUDIO_IN_DEVICE_ANALOG_LINE1) ? CS42L51_IN_LINE1 : CS42L51_IN_MIC1;

              /* Receive fake I2S data in order to generate MCLK needed by CS42L51 to set its registers */
              if(HAL_I2S_Receive_DMA(&haudio_in_i2s, ((uint16_t*)0x38000000), 16) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }/* Initialize the codec internal registers */
              else if(Audio_Drv->Init(Audio_CompObj, &codec_init) != 0)
              {
                ret = BSP_ERROR_COMPONENT_FAILURE;
              }
              else
              {
                /* Stop receiving fake I2S data */
                if(HAL_I2S_DMAStop(&haudio_in_i2s) != HAL_OK)
                {
                  ret = BSP_ERROR_PERIPH_FAILURE;
                }
              }
#if (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
              }
#endif
#endif  /*USE_AUDIO_CODEC_CS42L51 == 1)*/
            }
#if (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
          }
#endif
        }
      }
      else /* (Instance == 2U) */
      {
        DFSDM_Filter_TypeDef* FilterInstnace[DFSDM_MIC_NUMBER] = {AUDIO_DFSDMx_MIC1_FILTER, AUDIO_DFSDMx_MIC2_FILTER,AUDIO_DFSDMx_MIC3_FILTER,AUDIO_DFSDMx_MIC4_FILTER,AUDIO_DFSDMx_MIC5_FILTER};
        DFSDM_Channel_TypeDef* ChannelInstance[DFSDM_MIC_NUMBER] = {AUDIO_DFSDMx_MIC1_CHANNEL, AUDIO_DFSDMx_MIC2_CHANNEL,AUDIO_DFSDMx_MIC3_CHANNEL,AUDIO_DFSDMx_MIC4_CHANNEL,AUDIO_DFSDMx_MIC5_CHANNEL};
        uint32_t DigitalMicPins[DFSDM_MIC_NUMBER] = {DFSDM_CHANNEL_SAME_CHANNEL_PINS, DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS, DFSDM_CHANNEL_SAME_CHANNEL_PINS, DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS, DFSDM_CHANNEL_SAME_CHANNEL_PINS};
        uint32_t DigitalMicType[DFSDM_MIC_NUMBER] = {DFSDM_CHANNEL_SPI_RISING, DFSDM_CHANNEL_SPI_FALLING, DFSDM_CHANNEL_SPI_RISING, DFSDM_CHANNEL_SPI_FALLING, DFSDM_CHANNEL_SPI_RISING};
        uint32_t Channel4Filter[DFSDM_MIC_NUMBER] = {AUDIO_DFSDMx_MIC1_CHANNEL_FOR_FILTER, AUDIO_DFSDMx_MIC2_CHANNEL_FOR_FILTER,AUDIO_DFSDMx_MIC3_CHANNEL_FOR_FILTER,AUDIO_DFSDMx_MIC4_CHANNEL_FOR_FILTER,AUDIO_DFSDMx_MIC5_CHANNEL_FOR_FILTER};
        MX_DFSDM_Config dfsdm_config;

        /* PLL clock is set depending on the AudioFreq (44.1khz vs 48khz groups) */
        if(Audio_In_Ctx[Instance].Device == AUDIO_IN_DEVICE_DIGITAL_MIC5)
        {
          if(MX_DFSDM2_ClockConfig(&haudio_in_dfsdm_channel[0], AudioInit->SampleRate) != HAL_OK)
          {
            ret = BSP_ERROR_CLOCK_FAILURE;
          }
        }
        else
        {
          if(MX_DFSDM1_ClockConfig(&haudio_in_dfsdm_channel[0], AudioInit->SampleRate) != HAL_OK)
          {
            ret = BSP_ERROR_CLOCK_FAILURE;
          }
        }

        if(ret == BSP_ERROR_NONE)
        {
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0)
          DFSDM_FilterMspInit(&haudio_in_dfsdm_filter[1]);
          DFSDM_ChannelMspInit(&haudio_in_dfsdm_channel[1]);
#else
          /* Register the default DFSDM MSP callbacks */
          if(Audio_In_Ctx[Instance].IsMspCallbacksValid == 0U)
          {
            if(BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
          }
          if(ret == BSP_ERROR_NONE)
          {
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */
            for(i = 0; i < DFSDM_MIC_NUMBER; i ++)
            {
              dfsdm_config.FilterInstance  = FilterInstnace[i];
              dfsdm_config.ChannelInstance = ChannelInstance[i];
              dfsdm_config.DigitalMicPins  = DigitalMicPins[i];
              dfsdm_config.DigitalMicType  = DigitalMicType[i];
              dfsdm_config.Channel4Filter  = Channel4Filter[i];
              dfsdm_config.RegularTrigger  = DFSDM_FILTER_SW_TRIGGER;
              /* MIC2, MIC3 and MIC4 should be synchronized to MIC1 if it's used */
              if((i >= 1U) && (i < 4U) && ((Audio_In_Ctx[Instance].Device & AUDIO_IN_DEVICE_DIGITAL_MIC1) == AUDIO_IN_DEVICE_DIGITAL_MIC1))
              {
                dfsdm_config.RegularTrigger = DFSDM_FILTER_SYNC_TRIGGER;
              }
              dfsdm_config.SincOrder       = DFSDM_FILTER_ORDER(Audio_In_Ctx[Instance].SampleRate);
              dfsdm_config.Oversampling    = DFSDM_OVER_SAMPLING(Audio_In_Ctx[Instance].SampleRate);
              dfsdm_config.ClockDivider    = DFSDM_CLOCK_DIVIDER(Audio_In_Ctx[Instance].SampleRate);
              dfsdm_config.RightBitShift   = DFSDM_MIC_BIT_SHIFT(Audio_In_Ctx[Instance].SampleRate);

              if(((AudioInit->Device >> i) & AUDIO_IN_DEVICE_DIGITAL_MIC1) == AUDIO_IN_DEVICE_DIGITAL_MIC1)
              {
                /* Default configuration of DFSDM filters and channels */
                if(Audio_In_Ctx[Instance].Device == AUDIO_IN_DEVICE_DIGITAL_MIC5)
                {
                  if(MX_DFSDM2_Init(&haudio_in_dfsdm_filter[i], &haudio_in_dfsdm_channel[i], &dfsdm_config) != HAL_OK)
                  {
                    /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
                    ret = BSP_ERROR_PERIPH_FAILURE;
                  }
                }
                else
                {
                  if(MX_DFSDM1_Init(&haudio_in_dfsdm_filter[i], &haudio_in_dfsdm_channel[i], &dfsdm_config) != HAL_OK)
                  {
                    /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
                    ret = BSP_ERROR_PERIPH_FAILURE;
                  }
                }

#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
                /* Register filter regular conversion callbacks */
                if(HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[i], HAL_DFSDM_FILTER_REGCONV_COMPLETE_CB_ID, DFSDM_FilterRegConvCpltCallback) != HAL_OK)
                {
                  ret = BSP_ERROR_PERIPH_FAILURE;
                }
                else
                {
                  if(HAL_DFSDM_Filter_RegisterCallback(&haudio_in_dfsdm_filter[i], HAL_DFSDM_FILTER_REGCONV_HALFCOMPLETE_CB_ID, DFSDM_FilterRegConvHalfCpltCallback) != HAL_OK)
                  {
                    ret = BSP_ERROR_PERIPH_FAILURE;
                  }
                }
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */
              }
              if(ret != BSP_ERROR_NONE)
              {
                break;
              }
            }
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
          }
#endif
        }
      }

      /* Update BSP AUDIO IN state */
      Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_STOP;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Deinit the audio IN peripherals.
  * @param  Instance  Audio IN instance: 0 for SAI, 1 for I2S and 2 for DFSDM
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_DeInit(uint32_t Instance)
{
  uint32_t i;
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if((Instance == 0U) || (Instance == 1U))
    {
      /* Reset audio codec if not currently used by audio out instance 0 or 1 */
      if ((Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) && (Audio_Out_Ctx[1].State == AUDIO_OUT_STATE_RESET))
      {
        if (CS42L51_PowerDown() != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
        if(Instance == 0U)
        {
          /* SAI peripheral de-initialization */
          if (HAL_SAI_DeInit(&haudio_in_sai) != HAL_OK)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
          /* De-initialize audio codec if not currently used by audio out instance 0 or 1 */
          else
          {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
            SAI_MspDeInit(&haudio_in_sai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
          }
        }
        else
        {
          /* I2S peripheral de-initialization */
          if (HAL_I2S_DeInit(&haudio_in_i2s) != HAL_OK)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
          /* De-initialize audio codec if not currently used by audio out instance 0 or 1 */
          else
          {
#if (USE_HAL_I2S_REGISTER_CALLBACKS == 0)
            I2S_MspDeInit(&haudio_in_i2s);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
          }
        }
        if ((Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) && (Audio_Out_Ctx[1].State == AUDIO_OUT_STATE_RESET))
        {
          if (Audio_Drv->DeInit(Audio_CompObj) < 0)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
        }

        if (ret == BSP_ERROR_NONE)
        {
          /* Update audio in context */
          Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RESET;
        }
      }
    }
    else /* (Instance == 2U) */
    {
      for(i = 0U; i < DFSDM_MIC_NUMBER; i++)
      {
        /* De-initializes DFSDM Filter handle */
        if(haudio_in_dfsdm_filter[i].Instance != NULL)
        {
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0)
          DFSDM_FilterMspDeInit(&haudio_in_dfsdm_filter[i]);
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0) */
          if(HAL_OK != HAL_DFSDM_FilterDeInit(&haudio_in_dfsdm_filter[i]))
          {
            return BSP_ERROR_PERIPH_FAILURE;
          }
          haudio_in_dfsdm_filter[i].Instance = NULL;
        }

        /* De-initializes DFSDM Channel handle */
        if(haudio_in_dfsdm_channel[i].Instance != NULL)
        {
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0)
          DFSDM_ChannelMspDeInit(&haudio_in_dfsdm_channel[i]);
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 0) */
          if(HAL_OK != HAL_DFSDM_ChannelDeInit(&haudio_in_dfsdm_channel[i]))
          {
            return BSP_ERROR_PERIPH_FAILURE;
          }
          haudio_in_dfsdm_channel[i].Instance = NULL;
        }
      }

      /* Reset Audio_In_Ctx[2].IsMultiBuff if any */
      Audio_In_Ctx[2].IsMultiBuff = 0;
    }
    /* Update BSP AUDIO IN state */
    Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RESET;
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Clock Config.
  * @param  hDfsdmChannel  DFSDM Channel Handle
  * @param  SampleRate     Audio frequency to be configured for the DFSDM Channel.
  * @note   This API is called by BSP_AUDIO_IN_Init()
  *         Being __weak it can be overwritten by the application
  * @retval HAL_status
  */
__weak HAL_StatusTypeDef MX_DFSDM1_ClockConfig(DFSDM_Channel_HandleTypeDef *hDfsdmChannel, uint32_t SampleRate)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hDfsdmChannel);

  HAL_StatusTypeDef ret = HAL_OK;
  RCC_PeriphCLKInitTypeDef rcc_ex_clk_init_struct;

