iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_audio.c
    /* Call Half Transfer Complete callback */
    if(RecBuffTrigger == (Audio_In_Ctx[2].Size/4U))
    {
      if(RecBuffHalf == 0U)
      {
        RecBuffHalf = 1;
        BSP_AUDIO_IN_HalfTransfer_CallBack(2);
      }
    }
    /* Call Transfer Complete callback */
    if(RecBuffTrigger == Audio_In_Ctx[2].Size/2U)
    {
      /* Reset Application Buffer Trigger */
      RecBuffTrigger = 0;
      RecBuffHalf = 0;
      /* Call the record update function to get the next buffer to fill and its size (size is ignored) */
      BSP_AUDIO_IN_TransferComplete_CallBack(2);
    }
  }
}
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Un-reset CS42L51.
  * @retval BSP status.
  */
static int32_t CS42L51_PowerUp(void)
{
  int32_t ret = BSP_ERROR_NONE;

#if (USE_BSP_IO_CLASS > 0)
  BSP_IO_Init_t IO_Init;

  /* Initialize the BSP IO driver and configure the CS42L51 reset pin */
  IO_Init.Pin  = IO_PIN_3;
  IO_Init.Mode = IO_MODE_OUTPUT_PP;
  IO_Init.Pull = IO_PULLDOWN;
  if(BSP_IO_Init(0, &IO_Init) != BSP_ERROR_NONE)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }
  else if (BSP_IO_WritePin(0, IO_PIN_3, IO_PIN_SET) != BSP_ERROR_NONE)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }
  else
  {
  /* Wait 1ms according CS42L51 datasheet */
  HAL_Delay(1);
  }
#endif /* USE_BSP_IO_CLASS > 0 */

  return ret;
}

/**
  * @brief  Reset CS42L51.
  * @retval BSP status.
  */
static int32_t CS42L51_PowerDown(void)
{
  int32_t ret;

#if (USE_BSP_IO_CLASS > 0)
  /* Reset the CS42L51 */
  ret = BSP_IO_WritePin(0, IO_PIN_15, IO_PIN_RESET);
#else /* USE_BSP_IO_CLASS == 1 */
  ret = BSP_ERROR_NONE;
#endif /* USE_BSP_IO_CLASS > 0 */

  return ret;
}

/**
  * @brief  Initialize the DFSDM channel MSP.
  * @param  hDfsdmChannel DFSDM Channel handle
  * @retval None
  */
static void DFSDM_ChannelMspInit(DFSDM_Channel_HandleTypeDef *hDfsdmChannel)
{
  GPIO_InitTypeDef  GPIO_InitStruct;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hDfsdmChannel);

  /* DFSDM pins configuration: DFSDM_CKOUT, DMIC_DATIN pins ------------------*/
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

  if(Audio_In_Ctx[2].Device == AUDIO_IN_DEVICE_DIGITAL_MIC5)
  {
    AUDIO_DFSDM2_CLK_ENABLE();
    AUDIO_DFSDM2_CKOUT_GPIO_CLK_ENABLE();
    AUDIO_DFSDMx_DATIN_MIC5_GPIO_CLK_ENABLE();

    GPIO_InitStruct.Pin = AUDIO_DFSDM2_CKOUT_PIN;
    GPIO_InitStruct.Alternate = AUDIO_DFSDM2_CKOUT_AF;
    HAL_GPIO_Init(AUDIO_DFSDM2_CKOUT_GPIO_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC5_PIN;
    GPIO_InitStruct.Alternate = AUDIO_DFSDMx_DATIN_MIC5_AF;
    HAL_GPIO_Init(AUDIO_DFSDMx_DATIN_MIC5_GPIO_PORT, &GPIO_InitStruct);
  }
  else
  {
    /* Enable DFSDM clock */
    AUDIO_DFSDM1_CLK_ENABLE();

    /* Enable GPIO clock */
    AUDIO_DFSDM1_CKOUT_GPIO_CLK_ENABLE();
    AUDIO_DFSDMx_DATIN_MIC1_GPIO_CLK_ENABLE();
    AUDIO_DFSDMx_DATIN_MIC2_GPIO_CLK_ENABLE();
    AUDIO_DFSDMx_DATIN_MIC3_GPIO_CLK_ENABLE();
    AUDIO_DFSDMx_DATIN_MIC4_GPIO_CLK_ENABLE();

    GPIO_InitStruct.Pin = AUDIO_DFSDM1_CKOUT_PIN;
    GPIO_InitStruct.Alternate = AUDIO_DFSDM1_CKOUT_AF;
    HAL_GPIO_Init(AUDIO_DFSDM1_CKOUT_GPIO_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC1_PIN;
    GPIO_InitStruct.Alternate = AUDIO_DFSDMx_DATIN_MIC1_AF;
    HAL_GPIO_Init(AUDIO_DFSDMx_DATIN_MIC1_GPIO_PORT, &GPIO_InitStruct);
    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC2_PIN;
    GPIO_InitStruct.Alternate = AUDIO_DFSDMx_DATIN_MIC2_AF;
    HAL_GPIO_Init(AUDIO_DFSDMx_DATIN_MIC2_GPIO_PORT, &GPIO_InitStruct);
    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC3_PIN;
    GPIO_InitStruct.Alternate = AUDIO_DFSDMx_DATIN_MIC3_AF;
    HAL_GPIO_Init(AUDIO_DFSDMx_DATIN_MIC3_GPIO_PORT, &GPIO_InitStruct);
    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC4_PIN;
    GPIO_InitStruct.Alternate = AUDIO_DFSDMx_DATIN_MIC4_AF;
    HAL_GPIO_Init(AUDIO_DFSDMx_DATIN_MIC4_GPIO_PORT, &GPIO_InitStruct);
  }
}

/**
  * @brief  DeInitialize the DFSDM channel MSP.
  * @param  hDfsdmChannel DFSDM Channel handle
  * @retval None
  */
static void DFSDM_ChannelMspDeInit(DFSDM_Channel_HandleTypeDef *hDfsdmChannel)
{
  GPIO_InitTypeDef  GPIO_InitStruct;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hDfsdmChannel);

  /* DFSDM pins configuration: DFSDM_CKOUT, DMIC_DATIN pins ------------------*/
  if(Audio_In_Ctx[2].Device == AUDIO_IN_DEVICE_DIGITAL_MIC5)
  {
    GPIO_InitStruct.Pin = AUDIO_DFSDM2_CKOUT_PIN;
    HAL_GPIO_DeInit(AUDIO_DFSDM2_CKOUT_GPIO_PORT, GPIO_InitStruct.Pin);

    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC5_PIN;
    HAL_GPIO_DeInit(AUDIO_DFSDMx_DATIN_MIC5_GPIO_PORT, GPIO_InitStruct.Pin);
  }
  else
  {
    GPIO_InitStruct.Pin = AUDIO_DFSDM1_CKOUT_PIN;
    HAL_GPIO_DeInit(AUDIO_DFSDM1_CKOUT_GPIO_PORT, GPIO_InitStruct.Pin);

    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC1_PIN;
    HAL_GPIO_DeInit(AUDIO_DFSDMx_DATIN_MIC1_GPIO_PORT, GPIO_InitStruct.Pin);
    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC2_PIN;
    HAL_GPIO_DeInit(AUDIO_DFSDMx_DATIN_MIC2_GPIO_PORT, GPIO_InitStruct.Pin);
    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC3_PIN;
    HAL_GPIO_DeInit(AUDIO_DFSDMx_DATIN_MIC3_GPIO_PORT, GPIO_InitStruct.Pin);
    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DATIN_MIC4_PIN;
    HAL_GPIO_DeInit(AUDIO_DFSDMx_DATIN_MIC4_GPIO_PORT, GPIO_InitStruct.Pin);
  }
}

/**
  * @brief  Initialize the DFSDM filter MSP.
  * @param  hDfsdmFilter DFSDM Filter handle
  * @retval None
  */
static void DFSDM_FilterMspInit(DFSDM_Filter_HandleTypeDef *hDfsdmFilter)
{
  uint32_t i, mic_num, mic_init[DFSDM_MIC_NUMBER] = {0};
  IRQn_Type AUDIO_DFSDM_DMAx_MIC_IRQHandler[DFSDM_MIC_NUMBER] = {AUDIO_DFSDMx_DMAx_MIC1_IRQ, AUDIO_DFSDMx_DMAx_MIC2_IRQ, AUDIO_DFSDMx_DMAx_MIC3_IRQ, AUDIO_DFSDMx_DMAx_MIC4_IRQ, AUDIO_DFSDMx_DMAx_MIC5_IRQ};
  DMA_Stream_TypeDef* AUDIO_DFSDMx_DMAx_MIC_STREAM[DFSDM_MIC_NUMBER] = {AUDIO_DFSDMx_DMAx_MIC1_STREAM, AUDIO_DFSDMx_DMAx_MIC2_STREAM, AUDIO_DFSDMx_DMAx_MIC3_STREAM, AUDIO_DFSDMx_DMAx_MIC4_STREAM, NULL};
  uint32_t AUDIO_DFSDMx_DMAx_MIC_REQUEST[DFSDM_MIC_NUMBER] = {AUDIO_DFSDMx_DMAx_MIC1_REQUEST, AUDIO_DFSDMx_DMAx_MIC2_REQUEST, AUDIO_DFSDMx_DMAx_MIC3_REQUEST, AUDIO_DFSDMx_DMAx_MIC4_REQUEST, AUDIO_DFSDMx_DMAx_MIC5_REQUEST};

